In [18]:
import pandas as pd

data = {'Alphabet': ['A', 'B', 'C', 'D'], 'Number': [1,2,3,4]}
df1 = pd.DataFrame(data)

data = {'Alphabet': ['E', 'F', 'G', 'H'], 'Number': [5,6,7,8]}
df2 = pd.DataFrame(data)

In [19]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [20]:
le.fit(list(set(df1['Alphabet']).union(set(df2['Alphabet']))))

LabelEncoder()

In [21]:
df1['Alphabet'] = le.transform(df1['Alphabet'])
df2['Alphabet'] = le.transform(df2['Alphabet'])

In [22]:
df1

   Alphabet  Number
0         0       1
1         1       2
2         2       3
3         3       4

In [23]:
df2

   Alphabet  Number
0         4       5
1         5       6
2         6       7
3         7       8